---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorSpacingFailure
source: html/918a1180-5de3-f7d3-a4cb-e6781fdb423e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorSpacingFailure Property

The spacing in the major direction is lower than diameter of the wire in the minor direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId MajorSpacingFailure { get; }
```